Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/parents_and_education.html.txt.tmx
Source language: en
Languages: ga

source: The Irish Constitution states that parents have primary responsibility for educating their child and it guarantees the parents’ right and duty to provide for their children’s education
ga: Sonraíonn Bunreacht na hÉireann gur ar thuismitheoirí atá an príomhdhualgas oideachas a chur ar a gcuid leanaí agus ráthaíonn sé ceart agus dualgas na dtuismitheoirí soláthar a dhéanamh d'oideachas a gcuid leanaí

source: It also says that the State requires that children receive 'a certain minimum education'
ga: Deirtear ann chomh maith gur riachtanas ón Stát é go bhfaigheann an leanbh 'oideachas íosta áirithe'

source: This certain minimum has not yet been defined in legislation or in official policy
ga: Níor sainmhíníodh an t-íosmhéid áirithe seo i reachtaíocht ná i mbeartas oifigiúil go fóill

source: Under the Education (Welfare) Act 2000 parents must make sure that their children receive a certain minimum education from the age of 6 to the age of 16
ga: Faoin Acht Oideachais (Leas) 2000 ní mór do thuismitheoirí a chinntiú go bhfaigheann a gcuid leanaí oideachas íosta áirithe agus iad idir 6 bliana agus 16 mbliana d'aois

source: According to the Act there is no absolute legal obligation on children to attend school or on their parents to send them to school
ga: De réir an Achta níl dearbhoibleagáid dhlíthiúil ar leanaí freastal ar scoil ná ar a dtuismitheoirí iad a chur chun na scoile

source: Parents may decide the school to which they wish to send their children but there is no constitutional obligation on a particular school to accept individual children
ga: Is féidir le tuismitheoirí an scoil a dteastaíonn uathu a leanaí a chur chuici a shocrú ach níl oibleagáid bhunreachtúil ar scoil áirithe glacadh le leanaí aonair

source: Parents are also entitled to provide education outside the school system if they wish
ga: Tá tuismitheoirí i dteideal oideachas a sholáthar lasmuigh den chóras scoile más mian leo

source: This could mean home education or private schools which do not follow a national curriculum
ga: D'fhéadfadh oideachas sa bhaile nó scoileanna príobháideacha nach leanann curaclam náisiúnta a bheith i gceist leis seo

source: There is a range of organisations and schemes providing support and information to parents concerning the education of their children
ga: Tá raon eagraíochtaí agus scéimeanna ann a chuireann tacaíocht agus eolas ar fáil do thuismitheoirí maidir le hoideachas a gcuid leanaí

source: They include the following:
ga: Ina measc sin tá:

source: Child and Family Agency
ga: An Gníomhaireacht um Leanaí agus an Teaghlach

source: The Child and Family Agency is the Government agency responsible for making sure that children attend school regularly or otherwise get an education
ga: Is é Gníomhaireacht um Leanaí agus an Teaghlach an ghníomhaireacht Rialtais atá freagrach as a chinntiú go bhfreastalaíonn leanaí ar scoil go rialta nó go bhfaigheann siad oideachas

source: The Agency’s educational welfare officers (EWOs) work with schools, teachers and parents with a view to encouraging regular school attendance and developing strategies to reduce absenteeism and early school leaving
ga: Oibríonn oifigigh leasa oideachais an Bhoird (EWO) le scoileanna, múinteoirí agus le tuismitheoirí d'fhonn tinreamh scoile a spreagadh agus straitéisí a fhorbairt chun neamhláithreachas agus luathfhágáil scoile a laghdú

source: The EWOs also act as advocates or supports to parents, guardians and children experiencing difficulty with school attendance or educational welfare
ga: Feidhmíonn na EWO'anna mar thacadóirí nó mar chúltaca do thuismitheoirí, do chaomhnóirí agus do leanaí a bhfuil deacracht acu le tinreamh scoile nó le leas oideachasúil

source: On 1 January 2014, the National Educational Welfare Board was abolished and its functions transferred to the Child and Family Agency
ga: Cuireadh deireadh leis an mBord Náisiúnta Leasa Oideachais an 1 Eanáir 2014 agus d’aistríodh a fheidhmeanna chuig an nGníomhaireacht um Leanaí agus an Teaghlach

source: Parents have a legal right to establish a parents’ association and membership must be open to all parents in the school
ga: Tá sé de cheart dlíthiúil ag tuismitheoirí cumann tuismitheoirí a bhunú agus caithfidh ballraíocht a bheith ar oscailt do thuismitheoirí uile na scoile

source: The primary aim of a parents’ association is to represent the interests of parents of children attending the school and to promote good relationships between parents and the school board of management, the principal and the teachers
ga: Is í príomhaidhm an chumainn tuismitheoirí ná ionadaíocht a dhéanamh ar leas na dtuismitheoirí agus na leanaí atá ag freastal ar an scoil agus chun dea-chaidrimh idir tuismitheoirí agus bord bainistíochta na scoile, an príomhoide agus na múinteoirí a chothú

source: The association can make representations to the school on issues of policy and advise the principal and board on any matter affecting the school
ga: Is féidir leis an gcumann ionadaíochtaí a chur faoi bhráid na scoile maidir le saincheisteanna beartais agus comhairle a thabhairt don phríomhoide agus don bhord maidir le ceist ar bith a mbíonn tionchar aici ar an scoil

source: It can also adopt a programme of activities that will promote the involvement of parents in the management of the school
ga: Is féidir leis clár gníomhaíochtaí a ghlacadh a chuirfidh rannpháirtíocht na dtuismitheoirí i mbainistíocht na scoile chun cinn

source: The important role of parents' associations is described in the circulars on parents as partners in education: 24/91 (primary schools) and M27/91 (post-primary schools), which are available on the website of the Department of Education and Skills
ga: Tá cur síos déanta ar ról tábhachtach chumainn na dtuismitheoirí i gciorcláin na Roinne Oideachais agus Scileanna maidir le tuismitheoirí mar chomhpháirtithe san oideachas: 24/91 (bunscoileanna) agus M27/91 (iarbhunscoileanna)

source: The National Parents Council – Post Primary runs a Leaving Certificate results helpline every August in association with the Institute of Guidance Counsellors
ga: Reáchtálann an Chomhairle Náisiúnta Tuismitheoirí–Iarbhunoideachas líne chabhrach maidir le torthaí na hArdteistiméireachta gach mí Lúnasa i gcomhpháirt le hInstitiúid na dTreoirchomhairleoirí

source: The National Parents Council (Primary) has published guidelines on Working Effectively as a Parent Association (pdf), which are available from the Council or can be downloaded from its website - see 'Where to apply' below
ga: D'fhoilsigh an Chomhairle Náisiúnta Tuismitheoirí (Bunoideachas) treoirlínte ar Oibriú Éifeachtach mar Chumann Tuismitheoirí (pdf) atá ar fáil ón gComhairle nó is féidir é a íoslódáil óna láithreán gréasáin - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: Among its activities it gives information to parents about parents' associations and children’s learning
ga: I measc a cuid gníomhaíochtaí tugann sí faisnéis do thuismitheoirí faoi chumainn tuismitheoirí agus foghlaim leanaí

source: It has a helpline for parents seeking help, information and support for special interest groups
ga: Tá líne chabhrach ann do thuismitheoirí a bhfuil cúnamh, faisnéis agus tacaíocht á lorg acu agus na grúpaí sainleasa

source: Most schools have boards of management
ga: Tá boird bhainistíochta ag formhór scoileanna

source: Under the Education Act 1998 the board of management in a school has a duty to ensure that the school is run for the benefit of the students and their parents and that an appropriate education is provided for each student at the school
ga: Faoi Acht Oideachais 1998 tá dualgas ar an mbord bainistíochta i scoil a chinntiú go reáchtáiltear an scoil chun leasa na ndaltaí agus a gcuid tuismitheoirí agus go gcuirtear oideachas cuí ar fáil do gach dalta ag an scoil

source: One of the responsibilities of the board of management is to promote contact between the school, the parents and the community and give reasonable help to a parents’ association in its formation and its activities
ga: Tá sé ar ceann de dhualgais an bhoird bhainistíochta teagmháil a chur chun cinn idir an scoil, na tuismitheoirí agus an pobal agus cúnamh réasúnta a thabhairt do chumann tuismitheoirí maidir lena fhoirmiú agus a ghníomhaíochtaí

source: This is the organisation that represents multi-denominational Educate Together primary schools and associations throughout Ireland
ga: Seo í an eagraíocht a dhéanann ionadaíocht thar ceann na mBunscoileanna agus na gcumann a bhaineann le hOideachas le Chéile ar fud Éireann

source: The schools are recognised by the Department of Education and Skills and work under the same regulations and funding structures as other national schools
ga: Tugann an Roinn Oideachais agus Scileanna aitheantas do na scoileanna agus feidhmíonn siad de réir na rialachán agus na struchtúr maoinithe céanna is a fheidhmíonn na scoileanna náisiúnta

source: Educate Together schools have a distinct ethos which guarantees equality of access to children irrespective of their social, cultural or religious backgrounds
ga: Tá éiteas faoi leith ag scoileanna a bhaineann le hOideachas le Chéile a dhéanann cothromaíocht rochtana a ráthú maidir le leanaí pé cúlraí sóisialta, cultúrtha nó creidimh atá acu

source: They also have a high level of parental participation in the operation of the school
ga: Tá leibhéal ard tuismitheoirí rannpháirteach i bhfeidhmiú na scoile

source: Home School Community Liaison Scheme
ga: Scéim Theagmhála Baile, Scoile agus an Phobail

source: The Home School Community Liaison Scheme is targeted at children in primary and post-primary schools who are at risk of dropping out of school or of not reaching their potential in the education system because of economic or social disadvantage
ga: Tá an Scéim Theagmhála Baile, Scoile agus an Phobail dírithe ar leanaí i mbunscoileanna agus in iar-bhunscoileanna a bhfuil baol ann go bhfágfaidís an scoil go luath nó nach mbainfidís lán a n-acmhainneacht amach sa chóras oideachais mar gheall ar mhíbhuntáiste eacnamaíoch nó sóisialta

source: In each local area the scheme co-ordinator is a qualified teacher appointed from the staff of the schools in the scheme
ga: I ngach ceantar áitiúil is múinteoir cáilithe é/í an comhordaitheoir a cheaptar ó fhoireann na scoileanna atá páirteach sa scéim

source: The co-ordinators work full-time outside the classroom to build relationships with the children’s parents or guardians
ga: Oibríonn na comhordaitheoirí go lánaimseartha lasmuigh den seomra ranga chun caidrimh a fhorbairt le tuismitheoirí nó le caomhnóirí na leanaí

source: They act as a link between home and school, encouraging parents to become more involved in their children’s education
ga: Feidhmíonn siad mar nasc idir an baile agus an scoil, ag spreagadh tuismitheoirí a bheith níos rannpháirtí in oideachas a gcuid leanaí

source: The Early Start Programme is a one-year preventative intervention scheme
ga: Is scéim aon bhliain coisctheach idirghabhála é Clár an Túis Luaith

source: It tackles educational disadvantage by targeting children between the ages of 3 and 4 who are at risk of not reaching their potential within the school system
ga: Téann sé i ngleic le míbhuntáiste oideachasúil trí dhíriú ar leanaí idir 3 agus 4 bliana d'aois a bhfuil an baol ann nach mbainfidh siad lán a n-acmhainneacht amach laistigh den chóras scoile

source: The programme aims to expose young children to an educational programme which would enhance their overall development and prevent school failure and to offset the effects of social disadvantage
ga: Is í aidhm an chláir taithí a thabhairt do leanaí óga ar chlár oideachasúil a chuirfeadh lena bhforbairt fhoriomlán agus a chuirfeadh bac ar theip scoile agus a dhéanfadh éifeachtaí an mhíbhuntáiste shóisialta a chúiteamh

source: Parental involvement is a key element in the programme and the parents of participating children become actively involved in their children's education
ga: Is gné thábhachtach í rannpháirtíocht tuistí sa chlár agus bíonn tuismitheoirí na leanaí rannpháirteacha bainteach ar bhonn gníomhach le hoideachas a gcuid leanaí

source: Early Start staff work with Home School Community Liaison co-ordinators to encourage parents to take part in both the everyday management and in the organisation of activities in the Early Start centre
ga: Oibríonn foireann an Túis Luaith le comhordaitheoirí na Scéime Teagmhála Baile, Scoile agus an Phobail chun tuismitheoirí a spreagadh a bheith páirteach le bainistíocht laethúil agus le heagrú na ngníomhaíochtaí in Ionad an Túis Luaith

source: National Council for Special Education
ga: An Chomhairle Náisiúnta um Oideachas Speisialta

source: The National Council for Special Education (NCSE) is a statutory body with responsibility for improving the delivery of education services to people with special educational needs
ga: Is comhlacht reachtúil í an Chomhairle Náisiúnta um Oideachas Speisialta (NCSE) ar a bhfuil dualgas seachadadh na seirbhísí oideachais do dhaoine a bhfuil riachtanais speisialta oideachais acu a fheabhsú

source: One of its primary roles is to provide information to parents in relation to the entitlements of children with special educational needs in primary and second-level schools
ga: Tá sé ar cheann dá phríomhrólanna faisnéis a chur ar fáil do thuismitheoirí maidir le teidlíochtaí leanaí a bhfuil riachtanais speisialta oideachais acu i mbunscoileanna agus i meánscoileanna

source: The NCSE employs Special Educational Needs Organisers (SENOs) who are responsible for allocating additional teaching and other resources to support the special educational needs of children with disabilities at local level
ga: Fostaíonn an NCSE Eagraithe Riachtanais Speisialta Oideachais (SENO'anna) atá freagrach as múinteoireacht bhreise a dháileadh mar aon le hacmhainní eile chun riachtanais speisialta oideachais leanaí a bhfuil míchumais acu a thacú ag an leibhéal áitiúil

source: SENOs are the point of contact for parents/guardians and schools
ga: Is pointe teagmhála iad SENO'anna do thuismitheoirí/chaomhnóirí agus do scoileanna

source: National Educational Psychological Service
ga: An tSeirbhís Náisiúnta Síceolaíochta Oideachais

source: The National Educational Psychological Service (NEPS) provides an educational psychology service to primary and post-primary schools
ga: Cuireann an tSeirbhís Náisiúnta Síceolaíochta Oideachais (NEPS) seirbhís síceolaíochta oideachais ar fáil do bhunscoileanna agus do mheánscoileanna

source: NEPS psychologists specialise in working with teachers, parents and children in identifying educational needs and providing a consultation service for teachers and parents
ga: Déanann síceolaithe NEPS speisialú as a bheith ag obair le múinteoirí, tuismitheoirí agus le leanaí chun riachtanais oideachais a aithint agus seirbhís sainchomhairliúcháin a chur ar fáil do mhúinteoirí agus do thuismitheoirí

source: Children are normally referred to NEPS through the school principal and parents should discuss any concerns regarding learning difficulties with school personnel
ga: De ghnáth déantar leanaí a tharchur chuig NEPS tríd an bpríomhoide agus ba chóir do thuismitheoirí ábhair imní ar bith a phlé maidir le deacrachtaí foghlama le pearsanra na scoile

source: The Department of Health produced a report on young parents in education (pdf) as part of its support of the Teen Parents Support Programme
ga: Chuir an Roinn Sláinte tuarascáil le chéile young parents in education (pdf) mar chuid dá tacaíocht don Chlár Tacaíochta do Thuismitheoirí sna Déaga

source: This report details the programmes available to support parents who want to continue their own education or training
ga: Sonraíonn an tuarascáil seo na cláir atá ar fáil chun tacú le tuismitheoirí a dteastaíonn uathu leanúint lena n-oideachas nó a n-oiliúint féin

source: The financial support offered through the social welfare system can play a major role in a young parent’s decision to return to or continue education or training
ga: Is féidir leis an tacaíocht airgeadais a thairgtear tríd an gcóras leasa sóisialta ról tábhachtach a bheith aige maidir le cinneadh an tuismitheora óig filleadh nó leanúint le hoideachas nó le hoiliúint

source: The Back to Education Allowance (BTEA) is administered by the Department of Social Protection as part of the Back to Education Programme
ga: Riarann an Roinn Coimirce Sóisialaí an Liúntas um Fhilleadh ar an Oideachas mar chuid den Chlár um Fhilleadh ar Oideachas

source: It allows people to return to full-time or part-time education while continuing to get income support
ga: Tugann sé deis do dhaoine filleadh ar oideachas lánaimseartha nó páirtaimseartha agus tacaíocht ioncaim á fáil acu i gcónaí

source: Early school-leavers programmes such as the Schools Completion Programme, the Vocational Training Opportunities Scheme, Youthreach and Post Leaving Certificate courses are aimed at increasing the number of young people staying in second-level schools or helping people get access to second-chance or alternative education
ga: Tá cláir luathfhágálaithe scoile ar nós an Clár Críochnaithe Scoileanna, an Scéim Deiseanna Oiliúna agus Gairmoideachais, Ógtheagmháil agus cúrsaí iar-Ardteistiméireachta dírithe ar líon na ndaoine óga atá ag fanacht i meánscoileanna a mhéadú nó cúnamh a thabhairt do dhaoine rochtain a fháil ar oideachas "athdheise" nó ar oideachas malartach
